In [91]:
# SQL Alchemy
from sqlalchemy import create_engine

# PyMySQL 
# This enables python to read MySQL databases
import pymysql
pymysql.install_as_MySQLdb()

# SQLite (since we've hit an AWS issue)
from sqlite3 import dbapi2 as sqlite

# Pandas
import pandas as pd

In [92]:
# Create engine from LOCALLY HOSTED SQLITE DATABASE
engine = create_engine('sqlite+pysqlite:///db//bellybutton.sqlite')
conn = engine.connect()

In [93]:
tables = pd.read_sql("SELECT * FROM sqlite_master WHERE type='table'", conn)
tables.head()

,type,name,tbl_name,rootpage,sql
0,table,samples,samples,2,"CREATE TABLE ""samples"" (\n""otu_id"" INTEGER,\n ..."
1,table,sample_metadata,sample_metadata,3,"CREATE TABLE ""sample_metadata"" (\n""sample"" INT..."

In [94]:
print(type(tables["tbl_name"][0]))
for table in tables.iterrows():
    print(table[1]["tbl_name"])

<class 'str'>
samples
sample_metadata

In [95]:
# see a bit of each table
for i, table in enumerate(tables.iterrows()):
    tname = table[1]['tbl_name']
    print(tname)
    data = pd.read_sql("SELECT * FROM " + tname, conn)
    print(data.head())

samples
   otu_id                                          otu_label  940  941  943  \
0       1  Archaea;Euryarchaeota;Halobacteria;Halobacteri...    0    0    0
1       2  Archaea;Euryarchaeota;Halobacteria;Halobacteri...    0    0    0
2       3  Archaea;Euryarchaeota;Halobacteria;Halobacteri...    0    0    0
3       4  Archaea;Euryarchaeota;Methanobacteria;Methanob...    0    0    0
4       5  Archaea;Euryarchaeota;Methanobacteria;Methanob...    0    0    0

   944  945  946  947  948  ...   1562  1563  1564  1572  1573  1574  1576  \
0    0    0    0    0  0.0  ...      0     0     0     0     0     0     0
1    0    0    0    0  0.0  ...      0     0     0     0     0     0     0
2    0    0    0    0  0.0  ...      0     0     0     0     0     0     0
3    0    0    0    0  0.0  ...      0     0     0     0     0     0     0
4    0    0    0    0  0.0  ...      0     0     0     0     0     0     0

   1577  1581  1601
0     0     0     0
1     0     0     0
2     0     0     0
3     0     0     0
4     0     0     0

[5 rows x 155 columns]
sample_metadata
   sample                      EVENT              ETHNICITY GENDER   AGE  \
0     940  BellyButtonsScienceOnline              Caucasian      F  24.0
1     941                       None  Caucasian/Midleastern      F  34.0
2     943  BellyButtonsScienceOnline              Caucasian      F  49.0
3     944  BellyButtonsScienceOnline               European      M  44.0
4     945  BellyButtonsScienceOnline              Caucasian      F  48.0

   WFREQ BBTYPE         LOCATION COUNTRY012 ZIP012   ...      DOG   CAT  \
0    2.0      I      Beaufort/NC        usa  22306   ...       no    no
1    1.0      I       Chicago/IL       None   None   ...     None  None
2    1.0      I         Omaha/NE       None   None   ...     None  None
3    1.0      I      NewHaven/CT        usa   7079   ...       no   yes
4    1.0      I  Philidelphia/PA        usa  84404   ...       no    no

  IMPSURFACE013     NPP013  MMAXTEMP013  PFC013  IMPSURFACE1319 NPP1319  \
0        8852.0  37.172222         54.5    None               1     NaN
1           NaN        NaN          NaN    None            None     NaN
2           NaN        NaN          NaN    None            None     NaN
3           NaN  35.816666         16.0    None               0  6567.0
4           NaN  37.783333          4.0    None               0  5613.0

  MMAXTEMP1319  PFC1319
0    33.990002     25.5
1          NaN      NaN
2          NaN      NaN
3    32.403332     28.5
4    33.634445     24.0

[5 rows x 22 columns]